Revit.Filter.FilterRule
Revit Filter Rule

Revit.Filter.FilterRule.InternalFilterRule
Internal reference to the Revit Element

Revit.Filter.FilterRule.#ctor(Autodesk.Revit.DB.FilterRule)
Reference to the Element
internalFilterRule:

Revit.Filter.FilterRule.CreatePrefix
Prefix for reflection call of Create Rule

Revit.Filter.FilterRule.RuleSuffix
Suffix for reflection call of Create Rule

Revit.Filter.FilterRule.ByRuleType(System.String,System.Object,Revit.Elements.Parameter)
Create a new Filter Rule
type: Filter Rule Type
value: Value to check
parameter: Parameter to filter
Returns: